app/services/films_service.rb

  def find_films_by_game(gameId)
    genres = JSON.parse(Game.find_by_game_id(gameId).genres)
    array = Array.new
    genres.each do |g|
      res = find_films_by_genre(GameGenre.find_by_name(g).genre_id)
---
SELECT "games".* FROM "games" WHERE "games"."game_id" = $1 LIMIT $2  [["game_id", 16944], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."game_id" = $1 LIMIT $2  [["game_id", 3498], ["LIMIT", 1]]
SELECT "game_genres".* FROM "game_genres" WHERE "game_genres"."name" = $1 LIMIT $2  [["name", "RPG"], ["LIMIT", 1]]

  def fill_film_genres_db
    FilmGenre.delete_all
    film_genres_data = film_genres
    film_genres_data.each do |f|
      @film_genre = FilmGenre.new(f)
      @film_genre.save!
---
DELETE FROM "film_genres"
INSERT INTO "film_genres" ("genre_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["genre_id", 28], ["name", "Action"], ["created_at", "2020-12-14 13:06:40.735734"], ["updated_at", "2020-12-14 13:06:40.735734"]]

  def find_films_by_genre(genreId)
    film_genre = FilmGenre.find_by_genre_id(genreId)
---
SELECT "film_genres".* FROM "film_genres" WHERE "film_genres"."genre_id" = $1 LIMIT $2  [["genre_id", 14], ["LIMIT", 1]]

  def all_films(page=1)
      url = URI("https://api.themoviedb.org/3/discover/movie?api_key=#{ENV['FILMS_API_KEY']}&language=en-US&sort_by=popularity.desc&page=#{page}")

      http = Net::HTTP.new(url.host, url.port)
      http.use_ssl = true
      http.verify_mode = OpenSSL::SSL::VERIFY_NONE

      request = Net::HTTP::Get.new(url)

      response = http.request(request)

      if page != 5
        page = page + 1
        all_films(page)
      end

      film_data = JSON.parse(response.read_body)["results"].map { |e|
        {title: e['title'],
         release_date: e['release_date'],
         description:e['overview'],
         genres:e['genre_ids'].map {|g|
           FilmGenre.find_by_genre_id(g).name
---
SELECT "film_genres".* FROM "film_genres" WHERE "film_genres"."genre_id" = $1 LIMIT $2  [["genre_id", 27], ["LIMIT", 1]]


      film_data.each do |f|
        @film = Film.new(f)
        @film.save!
---
INSERT INTO "films" ("film_id", "title", "release_date", "genres", "background_image", "rating", "poster", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def film_genres
    url = URI("https://api.themoviedb.org/3/genre/movie/list?api_key=#{ENV['FILMS_API_KEY']}&language=en-US")
    http = Net::HTTP.new(url.host, url.port)
    http.use_ssl = true
    http.verify_mode = OpenSSL::SSL::VERIFY_NONE

    request = Net::HTTP::Get.new(url)

    response = http.request(request)
    JSON.parse(response.read_body)["genres"].map do |e|
---
SELECT "film_genres".* FROM "film_genres" WHERE "film_genres"."genre_id" = $1 LIMIT $2  [["genre_id", 28], ["LIMIT", 1]]