app/services/games_service.rb

SELECT "films".* FROM "films" WHERE "films"."film_id" = $1 LIMIT $2  [["film_id", 521029], ["LIMIT", 1]]
SELECT "films".* FROM "films" WHERE "films"."film_id" = $1 LIMIT $2  [["film_id", 590706], ["LIMIT", 1]]
SELECT "film_genres".* FROM "film_genres" WHERE "film_genres"."name" = $1 LIMIT $2  [["name", "Horror"], ["LIMIT", 1]]
---
  def find_games_by_film(filmId)
    genres = JSON.parse(Film.find_by_film_id(filmId).genres)
    array = Array.new
    genres.each do |g|
      res = find_games_by_genre(FilmGenre.find_by_name(g).genre_id)

SELECT "game_genres".* FROM "game_genres" WHERE "game_genres"."genre_id" = $1 LIMIT $2  [["genre_id", 27], ["LIMIT", 1]]
---
  def find_games_by_genre(genre_id)
    game_genre = GameGenre.find_by_genre_id(genre_id)

INSERT INTO "games" ("game_id", "title", "release_date", "genres", "rating", "background_image", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---

   games_data.each do |f|
     @game = Game.new(f)
     @game.save!