app/controllers/api/v1/films_controller.rb

SELECT "films".* FROM "films"
---
  def index
    FilmsService.new.fill_films_db
    @films = Film.all