app/controllers/api/v1/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    GamesService.new.fill_games_db
    @games = Game.all