app/controllers/api/v1/related_games_controller.rb

  def index
    render json: GamesService.new.find_games_by_film(params[:film_id])
---
SELECT "films".* FROM "films" WHERE "films"."film_id" = $1 LIMIT $2  [["film_id", 590706], ["LIMIT", 1]]