app/controllers/api/v1/related_films_controller.rb

  def index
    render json: FilmsService.new.find_films_by_game(params[:game_id])
---
SELECT "games".* FROM "games" WHERE "games"."game_id" = $1 LIMIT $2  [["game_id", 3498], ["LIMIT", 1]]